VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
#if defined MPU6050
    /* Check product revision. */
    MPU_Read(st->reg->accel_offs, data, 6);
    rev = ((data[5] & 0x01) << 2) | ((data[3] & 0x01) << 1) |
        (data[1] & 0x01);

    if (rev) {
        /* Congrats, these parts are better. */
        if (rev == 1)
            st->chip_cfg.accel_half = 1;
        else if (rev == 2)
            st->chip_cfg.accel_half = 0;
        else {
            return -4;
        }
    } else {
        MPU_ReadByte(st->reg->prod_id, &data[0]);
        rev = data[0] & 0x0F;
        if (!rev) {
            return -6;
        } else if (rev == 4) {
            st->chip_cfg.accel_half = 1;
        } else
            st->chip_cfg.accel_half = 0;
    }
#elif defined MPU6500
#define MPU6500_MEM_REV_ADDR    (0x17)
    MPU_MemRead(MPU6500_MEM_REV_ADDR, &rev, 1);
    if (rev == 0x1)
        st->chip_cfg.accel_half = 0;
    else {
        return -8;
    }

    /* MPU6500 shares 4kB of memory between the DMP and the FIFO. Since the
     * first 3kB are needed by the DMP, we'll use the last 1kB for the FIFO.
     */
    data[0] = ;
    MPU_WriteByte(st->reg->accel_cfg2, 1, BIT_FIFO_SIZE_1024 | 0x8);
#endif

    /* Set to invalid values to ensure no I2C writes are skipped. */
    st->chip_cfg.sensors = 0xFF;
    st->chip_cfg.gyro_fsr = 0xFF;
    st->chip_cfg.accel_fsr = 0xFF;
    st->chip_cfg.lpf = 0xFF;
    st->chip_cfg.sample_rate = 0xFFFF;
    st->chip_cfg.fifo_enable = 0xFF;
    st->chip_cfg.bypass_mode = 0xFF;
#ifdef AK89xx_SECONDARY
    st->chip_cfg.compass_sample_rate = 0xFFFF;
#endif
    /* mpu_set_sensors always preserves this setting. */
    st->chip_cfg.clk_src = INV_CLK_PLL;
    /* Handled in next call to mpu_set_bypass. */
    st->chip_cfg.active_low_int = 0;
    st->chip_cfg.latched_int = 1;
    st->chip_cfg.int_motion_only = 0;
    st->chip_cfg.lp_accel_mode = 0;
    memset(&st->chip_cfg.cache, 0, sizeof(st->chip_cfg.cache));
    st->chip_cfg.dmp_on = 0;
    st->chip_cfg.dmp_loaded = 0;
    st->chip_cfg.dmp_sample_rate = 0;

    if (MPU_SetGyroFsr(250))
        return -10;
    if (MPU_SetAccelFsr(16))
        return -11;
    if (MPU_SetLPF(42))
        return -12;
    if (MPU_SetSampleRate(50))
        return -13;
    if (MPU_ConfigureFIFO(0))
        return -14;

    if (int_param)
        reg_int_cb(int_param);

#ifdef AK89xx_SECONDARY
    errCode = setup_compass();
    if (errCode != 0) {
    }
    if (MPU_SetCompassSampleRate(10))
        return -15;
#else
    /* Already disabled by setup_compass. */
    if (MPU_SetBypass(0))
        return -16;
#endif

    MPU_SetSensors(0);
    return 0;
}

int MPU_SetGyroFsr(uint16_t fsr) {
    uint8_t data;

    if (!(st->chip_cfg.sensors))
        return -1;

    switch (fsr) {
    case 250:
        data = INV_FSR_250DPS << 3;
        break;
    case 500:
        data = INV_FSR_500DPS << 3;
        break;
    case 1000:
        data = INV_FSR_1000DPS << 3;
        break;
    case 2000:
        data = INV_FSR_2000DPS << 3;
        break;
    default:
        return -2;
    }

    if (st->chip_cfg.gyro_fsr == (data >> 3))
        return 0;
    if (MPU_WriteByteAndCheck(st->reg->gyro_cfg, data)) {
        return -3;
    }
    
    st->chip_cfg.gyro_fsr = data >> 3;
    return 0;
}

int MPU_SetAccelFsr(uint16_t fsr) {
    uint8_t data;

    if (!(st->chip_cfg.sensors))
        return -1;

    switch (fsr) {
    case 2:
        data = INV_FSR_2G << 3;
        break;
    case 4:
        data = INV_FSR_4G << 3;
        break;
    case 8:
        data = INV_FSR_8G << 3;
        break;
    case 16:
        data = INV_FSR_16G << 3;
        break;
    default:
        return -2;
    }

    if (st->chip_cfg.accel_fsr == (data >> 3))
        return 0;
    if (MPU_WriteByteAndCheck(st->reg->accel_cfg, data)) {
        return -3;
    }
    
    st->chip_cfg.accel_fsr = data >> 3;
    return 0;
}

/**
 *  @brief      Set digital low pass filter.
 *  The following LPF settings are supported: 188, 98, 42, 20, 10, 5.
 *  @param[in]  lpf Desired LPF setting.
 *  @return     0 if successful.
 */
int MPU_SetLPF(uint16_t lpf) {
    uint8_t data;
    if (!(st->chip_cfg.sensors))
        return -1;

    if (lpf >= 188)
        data = INV_FILTER_188HZ;
    else if (lpf >= 98)
        data = INV_FILTER_98HZ;
    else if (lpf >= 42)
        data = INV_FILTER_42HZ;
    else if (lpf >= 20)
        data = INV_FILTER_20HZ;
    else if (lpf >= 10)
        data = INV_FILTER_10HZ;
    else
        data = INV_FILTER_5HZ;

    if (st->chip_cfg.lpf == data)
        return 0;
    if (MPU_WriteByteAndCheck(st->reg->lpf, data)) {
        return -3;
    }
    
    st->chip_cfg.lpf = data;
    return 0;
}

/**
 *  @brief      Set sampling rate.
 *  Sampling rate must be between 4Hz and 1kHz.
 *  @param[in]  rate    Desired sampling rate (Hz).
 *  @return     0 if successful.
 */
int MPU_SetSampleRate(uint16_t rate) {
    uint8_t data;

    if (!(st->chip_cfg.sensors))
        return -1;

    if (st->chip_cfg.dmp_on)
        return -1;
    else {
        if (st->chip_cfg.lp_accel_mode) {
            if (rate && (rate <= 40)) {
                /* Just stay in low-power accel mode. */
                MPU_LowPowerAccelMode(rate);
                return 0;
            }
            /* Requested rate exceeds the allowed frequencies in LP accel mode,
             * switch back to full-power mode.
             */
            MPU_LowPowerAccelMode(0);
        }
        if (rate < 4)
            rate = 4;
        else if (rate > 1000)
            rate = 1000;

        data = 1000 / rate - 1;
        if (MPU_WriteByteAndCheck(st->reg->rate_div, data)) {
            return -3;
        }
        
        st->chip_cfg.sample_rate = 1000 / (1 + data);

#ifdef AK89xx_SECONDARY
        MPU_SetCompassSampleRate(min(st->chip_cfg.compass_sample_rate, MAX_COMPASS_SAMPLE_RATE));
#endif

        /* Automatically set LPF to 1/2 sampling rate. */
        MPU_SetLPF(st->chip_cfg.sample_rate >> 1);
        return 0;
    }
}

/**
 *  @brief      Enter low-power accel-only mode.
 *  In low-power accel mode, the chip goes to sleep and only wakes up to sample
 *  the accelerometer at one of the following frequencies:
 *  \n MPU6050: 1.25Hz, 5Hz, 20Hz, 40Hz
 *  \n MPU6500: 1.25Hz, 2.5Hz, 5Hz, 10Hz, 20Hz, 40Hz, 80Hz, 160Hz, 320Hz, 640Hz
 *  \n If the requested rate is not one listed above, the device will be set to
 *  the next highest rate. Requesting a rate above the maximum supported
 *  frequency will result in an error.
 *  \n To select a fractional wake-up frequency, round down the value passed to
 *  @e rate.
 *  @param[in]  rate        Minimum sampling rate, or zero to disable LP
 *                          accel mode.
 *  @return     0 if successful.
 */
int MPU_LowPowerAccelMode(uint8_t rate) {
    uint8_t tmp[2];

    if (rate > 40)
        return -1;

