VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
    div = st->chip_cfg.sample_rate / rate - 1;
    MPU_WriteByte(st->reg->s4_ctrl, div);
    st->chip_cfg.compass_sample_rate = st->chip_cfg.sample_rate / (div + 1);
    return 0;
#else
    return -1;
#endif
}

/**
 *  @brief      Turn specific sensors on/off.
 *  @e sensors can contain a combination of the following flags:
 *  \n INV_X_GYRO, INV_Y_GYRO, INV_Z_GYRO
 *  \n INV_XYZ_GYRO
 *  \n INV_XYZ_ACCEL
 *  \n INV_XYZ_COMPASS
 *  @param[in]  sensors    Mask of sensors to wake.
 *  @return     0 if successful.
 */
int MPU_SetSensors(uint8_t sensors)  {
    uint8_t data;
#ifdef AK89xx_SECONDARY
    uint8_t user_ctrl;
#endif

    if (sensors & INV_XYZ_GYRO)
        data = INV_CLK_PLL;
    else if (sensors)
        data = 0;
    else
        data = BIT_SLEEP;
    if (MPU_WriteByteAndCheck(st->reg->pwr_mgmt_1, data)) {
        return -3;
    }
    
    st->chip_cfg.clk_src = data & ~BIT_SLEEP;

    data = 0;
    if (!(sensors & INV_X_GYRO))
        data |= BIT_STBY_XG;
    if (!(sensors & INV_Y_GYRO))
        data |= BIT_STBY_YG;
    if (!(sensors & INV_Z_GYRO))
        data |= BIT_STBY_ZG;
    if (!(sensors & INV_XYZ_ACCEL))
        data |= BIT_STBY_XYZA;
    if (MPU_WriteByteAndCheck(st->reg->pwr_mgmt_2, data)) {
        return -3;
    }

    if (sensors && (sensors != INV_XYZ_ACCEL))
        /* Latched interrupts only used in LP accel mode. */
        MPU_SetIntLatched(0);

#ifdef AK89xx_SECONDARY
#ifdef AK89xx_BYPASS
    if (sensors & INV_XYZ_COMPASS)
        mpu_set_bypass(1);
    else
        mpu_set_bypass(0);
#else
    user_ctrl = MPU_ReadByte(st->reg->user_ctrl);
    /* Handle AKM power management. */
    if (sensors & INV_XYZ_COMPASS) {
        data = AKM_SINGLE_MEASUREMENT;
        user_ctrl |= BIT_AUX_IF_EN;
    } else {
        data = AKM_POWER_DOWN;
        user_ctrl &= ~BIT_AUX_IF_EN;
    }
    if (st->chip_cfg.dmp_on)
        user_ctrl |= BIT_DMP_EN;
    else
        user_ctrl &= ~BIT_DMP_EN;
    if (MPU_WriteByteAndCheck(st->reg->s1_do, data)) {
        return -3;
    }
    /* Enable/disable I2C master mode. */
    if (MPU_WriteByteAndCheck(st->reg->user_ctrl, user_ctrl)) {
        return -3;
    }
#endif
#endif
    st->chip_cfg.sensors = sensors;
    st->chip_cfg.lp_accel_mode = 0;
    Delay_ms(50);
    return 0;
}

void Mag_WriteByte(uint8_t address, uint8_t data) {
    // Mag I2C address
    MPU_WriteByte(I2C_SLV0_ADDR, WRITE_COMMAND | AK8963_I2C_ADDRESS);
    MPU_WriteByte(I2C_SLV0_REG, address);
    MPU_WriteByte(I2C_SLV0_DO, data);
    // I2C on, 1 byte
    MPU_WriteByte(I2C_SLV0_CTRL, 0x81);
}

uint8_t Mag_ReadByte(uint8_t address) {
    uint8_t tmp;
    // Mag I2C address
    MPU_WriteByte(I2C_SLV0_ADDR, READ_COMMAND | AK8963_I2C_ADDRESS);
    MPU_WriteByte(I2C_SLV0_REG, address);
    // I2C on, 1 byte
    MPU_WriteByte(I2C_SLV0_CTRL, 0x81);
    Delay_ms(1);
    tmp = MPU_ReadByte(EXT_SENS_DATA_00);
    return tmp;
}

void Mag_Read(uint8_t address, uint8_t *data, uint8_t size) {
    // I2C address for reading
    MPU_WriteByte(I2C_SLV0_ADDR, READ_COMMAND | AK8963_I2C_ADDRESS);
    // reading from ASAX register
    MPU_WriteByte(I2C_SLV0_REG, address);
    // Read 3 bytes
    MPU_WriteByte(I2C_SLV0_CTRL, 0x80 | size);
    Delay_ms(1);
    MPU_Read(EXT_SENS_DATA_00, data, 3);
}

/* This initialization is similar to the one in ak8975.c. */
static int setup_compass(void)
{
#ifdef AK89xx_SECONDARY
    uint8_t data[4], akm_addr;

    MPU_SetBypass(1);

    /* Find compass. Possible addresses range from 0x0C to 0x0F. */
    for (akm_addr = 0x0C; akm_addr <= 0x0F; akm_addr++) {
        data[0] = Mag_ReadByte(AKM_REG_WHOAMI);
        if (data[0] == AKM_WHOAMI)
            break;
    }

    if (akm_addr > 0x0F) {
        /* TODO: Handle this case in all compass-related functions. */
        return -1;
    }

    st->chip_cfg.compass_addr = akm_addr;

    Mag_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
    Delay_ms(1);

    data[0] = AKM_FUSE_ROM_ACCESS;
    Mag_WriteByte(AKM_REG_CNTL, AKM_FUSE_ROM_ACCESS);
    Delay_ms(1);

    /* Get sensitivity adjustment data from fuse ROM. */
    Mag_Read(AKM_REG_ASAX, data, 3);
    st->chip_cfg.mag_sens_adj[0] = (long)data[0] + 128;
    st->chip_cfg.mag_sens_adj[1] = (long)data[1] + 128;
    st->chip_cfg.mag_sens_adj[2] = (long)data[2] + 128;

    data[0] = AKM_POWER_DOWN;
    Mag_WriteByte(AKM_REG_CNTL, AKM_POWER_DOWN);
    Delay_ms(1);

    MPU_SetBypass(0);

    /* Set up master mode, master clock, and ES bit. */
    MPU_WriteByte(st->reg->i2c_mst, 0x40);

    /* Slave 0 reads from AKM data registers. */
    MPU_WriteByte(st->reg->s0_addr, BIT_I2C_READ | st->chip_cfg.compass_addr);

    /* Compass reads start at this register. */
    MPU_WriteByte(st->reg->s0_reg, AKM_REG_ST1);

    /* Enable slave 0, 8-byte reads. */
    MPU_WriteByte(st->reg->s0_ctrl, BIT_SLAVE_EN | 8);

    /* Slave 1 changes AKM measurement mode. */
    MPU_WriteByte(st->reg->s1_addr, st->chip_cfg.compass_addr);

    /* AKM measurement mode register. */
    MPU_WriteByte(st->reg->s1_reg, AKM_REG_CNTL);

    /* Enable slave 1, 1-byte writes. */
    MPU_WriteByte(st->reg->s1_ctrl, BIT_SLAVE_EN | 1);

    /* Set slave 1 data. */
    MPU_WriteByte(st->reg->s1_do, AKM_SINGLE_MEASUREMENT);

    /* Trigger slave 0 and slave 1 actions at each sample. */
    MPU_WriteByte(st->reg->i2c_delay_ctrl, 0x03);

#ifdef MPU9150
    /* For the MPU9150, the auxiliary I2C bus needs to be set to VDD. */
    MPU_WriteByte(st->reg->yg_offs_tc, BIT_I2C_MST_VDDIO);
#endif

    return 0;
#else
    return -16;
#endif
}

/**
 *  @brief      Set device to bypass mode.
 *  @param[in]  bypass_on   1 to enable bypass mode.
 *  @return     0 if successful.
 */
int MPU_SetBypass(uint8_t bypass_on) {
    uint8_t tmp;

    if (st->chip_cfg.bypass_mode == bypass_on)
        return 0;

    if (bypass_on) {
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        tmp &= ~BIT_AUX_IF_EN;
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        Delay_ms(3);
        tmp = BIT_BYPASS_EN;
        if (st->chip_cfg.active_low_int)
            tmp |= BIT_ACTL;
        if (st->chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        MPU_WriteByte(st->reg->int_pin_cfg, tmp);
    } else {
        /* Enable I2C master mode if compass is being used. */
        MPU_WriteByte(st->reg->user_ctrl, tmp);
 
        if (st->chip_cfg.sensors & INV_XYZ_COMPASS)
            tmp |= BIT_AUX_IF_EN;
        else
            tmp &= ~BIT_AUX_IF_EN;
        MPU_WriteByte(st->reg->user_ctrl, tmp);
        Delay_ms(3);
        if (st->chip_cfg.active_low_int)
            tmp = BIT_ACTL;
        else
            tmp = 0;
        if (st->chip_cfg.latched_int)
            tmp |= BIT_LATCH_EN | BIT_ANY_RD_CLR;
        MPU_WriteByte(st->reg->int_pin_cfg, tmp);
    }
    st->chip_cfg.bypass_mode = bypass_on;
    return 0;
}


//uint8_t imu_test = 0;
//void MPU_Init() {
//    // WHO_AM_I, reset value = 0x71
//    imu_test = MPU_ReadByte(WHO_AM_I);
//    
//    // PLL as clock source
//    MPU_WriteByte(PWR_MGMT_1, 0x01);
//    imu_test = MPU_ReadByte(PWR_MGMT_1);

//    // 1000 Hz sample rate, 41 Hz gyro bandwidth
//    MPU_WriteByte(CONFIG, 0x03);
//    imu_test = MPU_ReadByte(CONFIG);   
//    
//    // divisor = 5, sample rate -> 200 Hz
//    MPU_WriteByte(SMPLRT_DIV, 0x04);
//    imu_test = MPU_ReadByte(SMPLRT_DIV);
//    
//    // gyro sensitivity - 250 dps
//    MPU_WriteByte(GYRO_CONFIG, 0x00);
//    imu_test = MPU_ReadByte(GYRO_CONFIG);
//    
//    // accel sensitivity - +-16g
//    MPU_WriteByte(ACCEL_CONFIG, 0x18);
//    imu_test = MPU_ReadByte(ACCEL_CONFIG);
//    
//    // 41 Hz accel bandwidth, 1000 Hz sample rate
//    MPU_WriteByte(ACCEL_CONFIG2, 0x03);
//    imu_test = MPU_ReadByte(ACCEL_CONFIG2);
//   
//    // Interrupt implemented by constant level, not pulses
//    MPU_WriteByte(INT_PIN_CFG, 0x30);
//    imu_test = MPU_ReadByte(INT_PIN_CFG);
//    
//    // Raw data ready interrupt enable
//    MPU_WriteByte(INT_ENABLE, 0x01);
//    imu_test = MPU_ReadByte(INT_ENABLE);
//    
//    // enable FIFO
////    MPU_WriteByte(USER_CTRL, 0x40);
////    imu_test = MPU_ReadByte(USER_CTRL);
////    
////    // accel, gyro, temp data to fifo
////    MPU_WriteByte(FIFO_EN, 0xf8);
////    imu_test = MPU_ReadByte(FIFO_EN);
//    
//    // enable DMP and FIFO
////    MPU_WriteByte(USER_CTRL, 0xc0);
////    imu_test = MPU_ReadByte(USER_CTRL);
////    
////    // no sensors data to FIFO
////    MPU_WriteByte(FIFO_EN, 0x00);
////    imu_test = MPU_ReadByte(FIFO_EN);
////    
////    // DMP interrupt enable
////    MPU_WriteByte(INT_ENABLE, 0x20);
////    imu_test = MPU_ReadByte(INT_ENABLE);
//}

void MPU_EXTI_Init() {
    GPIOA->OSPEEDR |= 3 << IMU_INT*2;
    
    SYSCFG->EXTICR[0] |= SYSCFG_EXTICR1_EXTI1_PA;
    
    EXTI->RTSR  |= EXTI_RTSR_TR1;       // rising
    EXTI->IMR   |= EXTI_IMR_MR1;        // non-masking
    NVIC_SetPriority(EXTI1_IRQn, 0x02);
    NVIC_EnableIRQ(EXTI1_IRQn);
}

void EXTI1_IRQHandler() {
    uint16_t fifo_count = 0;
    uint8_t tmp[2];
    if (EXTI->PR & EXTI_PR_PR1) {
        EXTI->PR = EXTI_PR_PR1;
        
        MPU_Read(FIFO_COUNTH, tmp, 2);
        fifo_count = (tmp[0] << 8) | tmp[1];
        if (fifo_count) {
            MPU_DMA_Run(MPU_DMA_tx, MPU_DMA_rx, MPU_READ_DATA_SIZE);
        }
    }
}

void swap(float *a, float *b) {
    float tmp = *a;
    *a = *b;
    *b = tmp;
}

