VlagaPalych/Stable/STM32/InvenSense/mpu9250.c
void DMA1_Stream3_IRQHandler() {
    uint8_t i = 0;
    int16_t tmp = 0;
    if (DMA1->LISR & DMA_LISR_TCIF3) {
        DMA1->LIFCR = DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        MPU_NSS_High();
        
        for (i = 0; i < 3; i++) {
            tmp = (MPU_DMA_rx[2*i+1] << 8) | MPU_DMA_rx[2*i+2];
            accel[i] = tmp / ACCEL_SENSITIVITY;
        }
        
//        tmp = (MPU_DMA_rx[7] << 8) | MPU_DMA_rx[8];
//        temp = tmp / TEMP_SENSITIBITY + TEMP_OFFSET;
        
        for (i = 0; i < 3; i++) {
            tmp = (MPU_DMA_rx[2*i+7] << 8) | MPU_DMA_rx[2*i+8];
            angleRate[i] = -tmp / GYRO_SENSITIVITY; // for QUEST algorithm
        }
        
//        for (i = 0; i < 3; i++) {
//            tmp = MPU_DMA_rx[2*i+15] | (MPU_DMA_rx[2*i+16] << 8);
//            magField[i] = tmp * MAG_SENSITIVITY * mag_sens_adj[i];
//        }
//        magField[2] = -magField[2];
//        swap(&magField[0], &magField[1]);  
        
//        if (meas1) {
//            meas1 = 0;
//            memcpy(w1, accel, VECT_SIZE*sizeof(float));
//            memcpy(w2, magField, VECT_SIZE*sizeof(float));
//            
//            Vect_Norm(w1);
//            Vect_Norm(w2);
//        } else {
//            process = 1;
//            memcpy(v1, accel, VECT_SIZE*sizeof(float));
//            memcpy(v2, magField, VECT_SIZE*sizeof(float));
//            
//            Vect_Norm(v1);
//            Vect_Norm(v2);
//        }
    }
}

void Mag_Init() {
    uint8_t tmp[3], i = 0;
    
    // Enable I2C master
    MPU_WriteByte(USER_CTRL, 0x20);
    
    Mag_WriteByte(AK8963_CNTL, 0x00); // Power down magnetometer  
    Delay_ms(10);   
    Mag_WriteByte(AK8963_CNTL, 0x0f); // Enter Fuse ROM access mode
    Delay_ms(10);
    
    // I2C address for reading
    MPU_WriteByte(I2C_SLV0_ADDR, READ_COMMAND | AK8963_I2C_ADDRESS);
    // reading from ASAX register
    MPU_WriteByte(I2C_SLV0_REG, AK8963_ASAX);
    // Read 3 bytes
    MPU_WriteByte(I2C_SLV0_CTRL, 0x83);
    Delay_ms(10);
    MPU_Read(EXT_SENS_DATA_00, tmp, 3);
    
    for (i = 0; i < 3; i++) {
        mag_sens_adj[i] = (tmp[i] - 128)*0.5 / 128.0f + 1.0f;
    }
    
    Mag_WriteByte(AK8963_CNTL, 0x00); // Power down magnetometer  
    Delay_ms(10);
    

    Mag_WriteByte(AK8963_CNTL, 0x16); // Continuous measurement mode 2 (100 Hz), 16 bit output
    Delay_ms(10);
    
    // Data ready interrupt waits for external sensor data
    MPU_WriteByte(I2C_MST_CTRL, 0x40);
    // I2C address for reading
    MPU_WriteByte(I2C_SLV0_ADDR, READ_COMMAND | AK8963_I2C_ADDRESS);
    // reading from HXL register
    MPU_WriteByte(I2C_SLV0_REG, AK8963_HXL);
    // Read 7 bytes
    MPU_WriteByte(I2C_SLV0_CTRL, 0x87);
}

/**
 *  @brief      Load and verify DMP image.
 *  @param[in]  length      Length of DMP image.
 *  @param[in]  firmware    DMP code.
 *  @param[in]  start_addr  Starting address of DMP code memory.
 *  @param[in]  sample_rate Fixed sampling rate used when DMP is enabled.
 *  @return     0 if successful.
 */
int MPU_LoadFirmware(uint16_t length, const uint8_t *firmware,
    uint16_t start_addr, uint16_t sample_rate) 
{        
    uint16_t ii;
    uint16_t this_write;

    /* Must divide evenly into st->hw->bank_size to avoid bank crossings. */
#define LOAD_CHUNK  (16)
    uint8_t cur[LOAD_CHUNK], tmp[2];

    if (st->chip_cfg.dmp_loaded)
        /* DMP should only be loaded once. */
        return -1;

    if (!firmware)
        return -2;
        
    for (ii = 0; ii < length; ii += this_write) {
        this_write = 32;//min(LOAD_CHUNK, length - ii);
        if (MPU_MemWrite(ii, (uint8_t *)&firmware[ii], this_write)) {
            return -3;
        }
        if (MPU_MemRead(ii, cur, this_write)) {
            return -3;
        }
        if (memcmp(&firmware[ii], cur, this_write)) {
            return -5;
        }
    }

    /* Set program start address. */
    tmp[0] = start_addr >> 8;
    tmp[1] = start_addr & 0xFF;
    if (MPU_WriteAndCheck(st->reg->prgm_start_h, tmp, 2))
        return -6;

    st->chip_cfg.dmp_loaded = 1;
    st->chip_cfg.dmp_sample_rate = sample_rate;
    return 0;
}

/**
 *  @brief      Enable/disable DMP support.
 *  @param[in]  enable  1 to turn on the DMP.
 *  @return     0 if successful.
 */
int MPU_SetDMPState(uint8_t enable) {
    uint8_t tmp;
    if (st->chip_cfg.dmp_on == enable)
        return 0;

    if (enable) {
        if (!st->chip_cfg.dmp_loaded)
            return -1;
        /* Disable data ready interrupt. */
        MPU_SetIntEnable(0);
        /* Disable bypass mode. */
        MPU_SetBypass(0);
        /* Keep constant sample rate, FIFO rate controlled by DMP. */
        MPU_SetSampleRate(st->chip_cfg.dmp_sample_rate);
        /* Remove FIFO elements. */
        MPU_WriteByte(st->reg->fifo_en, 0x00);
        st->chip_cfg.dmp_on = 1;
        /* Enable DMP interrupt. */
        MPU_SetIntEnable(1);
        MPU_ResetFIFO();
    } else {
        /* Disable DMP interrupt. */
        MPU_SetIntEnable(0);
        /* Restore FIFO settings. */
        tmp = st->chip_cfg.fifo_enable;
        MPU_WriteByte(st->reg->fifo_en, st->chip_cfg.fifo_enable);
        st->chip_cfg.dmp_on = 0;
        MPU_ResetFIFO();
    }
    return 0;
}

